{
  "main": {
    "name":"Kaustubh Pimparkar",
    "description":"Software Developer / Lifetime Student",
    "image":"profilepic.jpg",
    "bio": "I'm a Computer Science and Engineering graduate from Santa Clara University with a strong passion for building fast, responsive, and user-friendly websites. My focus has been on full-stack and WordPress development, including custom themes, plugins, and SEO optimization. I enjoy exploring web technologies, working on meaningful digital experiences, and staying updated with modern design trends. Outside of coding, I enjoy hiking and gaming to recharge.",
    "contactmessage":"Feel free to contact me via email, this form, or LinkedIn",
    "email": "pimparkarkaustubh02@gmail.com",
    "phone": "",
    "github":"https://github.com/kaustubhpimparkar123",
    "project":"https://www.linkedin.com/in/kaustubh-pimparkar-45042115a/",
    "address":{
      "street":"50 Washington Street",
      "city":"Santa Clara",
      "state":"CA",
      "zip": "95050"
    },
    "website": "https://github.com/tutchings",
    "social":[
      {
        "name":"github",
        "url":"https://github.com/tutchings",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/thomas-tutchings-2340871b7/",
        "className":"fa fa-linkedin"
      }
    ]
  },
  "resume":{
    "skillmessage":"* Each skill level is weighted in correlation to the remaining skills",
    "education":[
      {
        "school": "Santa Clara University, CA",
        "gpa": "3.72 GPA",
        "degree": "M.S. in Computer Science and Engineering",
        "graduated": "March 2023",
        "description": "Coursework Included: Web Development, Software Engineering, Distributed Systems, Computer Networks, Operating Systems, Cloud Computing, Human-Computer Interaction, Advanced Database Systems."
      }
    ],
    "work":[
      {
        "company": "SkyCool Systems",
        "title": "Founding Software Engineer",
        "years": "June 2023 – February 2025",
        "description": "Led full-stack development of internal dashboards for real-time monitoring of IoT sensor data using ReactJS, PHP, and Python. Built RESTful APIs and backend services to support dynamic data ingestion, alerting, and user access control. Integrated InfluxDB for handling time-series data and implemented role-based access features for field and operations teams. Optimized frontend performance and responsive design to ensure usability across field devices."
      },
      {
        "company": "Arista Networks",
        "title": "Software Engineer",
        "years": "April 2021 -– January 2022",
        "description": "Developed and maintained internal web applications to automate configuration, monitoring, and validation tasks for network devices. Used Flask and ReactJS to build scalable, testable full-stack tools with intuitive UI and robust backend logic. Designed REST APIs to interface with internal systems and improve developer workflows. Enhanced user experience and performance through frontend refactors, while adhering to code quality and CI/CD standards."
      },
      {
        "company":"Union Bank of Switzerland",
        "title":"Software Engineer",
        "years":"July 2017 - February 2020",
        "description":"Engineered and maintained Transaction and Performance processing with CheckFree’s Global Investment Manager (GIM) system. Designed processes using database programming and shell scripting to do various tasks in the system, including Account Conversion, Performance Scheduling, Sub-Accounting. Created Automation Bots using UiPath to automate the UI Health Check of Banking Applications"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title": "SkyCool Systems Website",
        "category": "Corporate WordPress Website",
        "image": "skycool-site.jpg",
        "url": "https://www.skycoolsystems.com/",
        "description": "Built and maintained the corporate website for SkyCool Systems with performance optimization, responsive design, and SEO best practices tailored for a climate-tech audience."
      },
      {
        "title": "StudiumTech Solutions",
        "category": "Business Website (WordPress)",
        "image": "studiumtech-site.jpg",
        "url": "https://www.studiumtech.in/",
        "description": "Developed a professional website for StudiumTech to showcase their AI-based solutions and services. Integrated custom themes, responsive UI, and clean content layout."
      }
    ]
  }
}
